atomiechen/PressureSense/nRF5_SDK_15.2.0_9412b96/examples/ble_central/serial_uart/main.c
    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = true;
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_UUID_FILTER, &m_nus_uuid);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_UUID_FILTER, false);
    APP_ERROR_CHECK(err_code);

    if (name_filter) {
      //设筛选广播name
      err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_NAME_FILTER, m_target_periph_name);
      APP_ERROR_CHECK(err_code);

      // 开启name filter
      err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, false);
      APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling database discovery events.
 *
 * @details This function is a callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function forwards the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
}


/**@brief Function for handling characters received by the Nordic UART Service (NUS).
 *
 * @details This function takes a list of characters of length data_len and prints the characters out on UART.
 *          If @ref ECHOBACK_BLE_UART_DATA is set, the data is sent back to sender.
 */
static void ble_nus_chars_received_uart_print_simple(uint8_t * p_data, uint16_t data_len,bool on_hvx_flag )
{
    ret_code_t ret_val;

    //NRF_LOG_DEBUG("Receiving data.");
    //NRF_LOG_HEXDUMP_DEBUG(p_data, data_len);
    do
    {
        ret_val = app_uart_put(0xFF);
        if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
        {
          NRF_LOG_ERROR("TX_put failed.");
           // APP_ERROR_CHECK(ret_val);
        }
    } while (ret_val == NRF_ERROR_BUSY);
  
    //扩增数列
    uint8_t Data_long[256 + 2*9];
    
    if (data_len >= 224) {
      decompress_data_224(p_data, Data_long);
      // copy IMU data
      for (int i = 224; i < data_len; i++) {
        Data_long[i - 224 + 256] = p_data[i];
      }
      data_len = data_len - 224 + 256;
    } else {
      for (int i = 0; i < data_len; i++) {
        Data_long[i] = p_data[i];
      }
    }

    if(on_hvx_flag==0)
    {
      for (uint32_t i = 0; i < data_len; i++)
      {
        do
        {
            ret_val = app_uart_put(Data_long[i]);
            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
            {
              NRF_LOG_ERROR("TX_put failed for index 0x?%04x : %04x.", i, ret_val);
               // APP_ERROR_CHECK(ret_val);
            }
        } while (ret_val == NRF_ERROR_BUSY);
      }
    }
}

void put_byte(uint8_t data) {
  ret_code_t ret_val;
  do
  {
      ret_val = app_uart_put(data);
      if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
      {
        NRF_LOG_ERROR("TX_put failed.");
         // APP_ERROR_CHECK(ret_val);
      }
  } while (ret_val == NRF_ERROR_BUSY);
}

static void ble_nus_chars_received_uart_print_secure(uint8_t * p_data, uint16_t data_len,bool on_hvx_flag )
{
    ret_code_t ret_val;

    //扩增数列
    uint8_t Data_long[256 + 9 * sizeof(int16_t)];
    
    if (data_len >= 224) {
      decompress_data_224(p_data, Data_long);
      // copy IMU data
      for (int i = 224; i < data_len; i++) {
        Data_long[i - 224 + 256] = p_data[i];
      }
      data_len = data_len - 224 + 256;
    } else {
      for (int i = 0; i < data_len; i++) {
        Data_long[i] = p_data[i];
      }
    }

    if(on_hvx_flag==0)
    {
      put_byte(0x5B);
      for (uint32_t i = 0; i < data_len; i++)
      {
        switch(Data_long[i]) {
          case 0x5B:
            put_byte(0x5C);
            put_byte(0x01);
            break;
          case 0x5C:
            put_byte(0x5C);
            put_byte(0x00);
            break;
          case 0x5D:
            put_byte(0x5C);
            put_byte(0x02);
            break;
          default:
            put_byte(Data_long[i]);
        }
      }
      put_byte(0x5D);
    }
}

void disconnect() {
  //断开连接
  ret_code_t err_code;
  if(m_ble_nus_c.conn_handle!=BLE_CONN_HANDLE_INVALID)
  {
      err_code = sd_ble_gap_disconnect(m_ble_nus_c.conn_handle,BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
      APP_ERROR_CHECK(err_code);
  }
}

const uint8_t HEAD = 0xEB;
const uint8_t TAIL = 0xED;
const uint8_t ESCAPE = 0xEC;
const uint8_t ESCAPE_ESCAPE = 0x00;
const uint8_t ESCAPE_HEAD = 0x01;
const uint8_t ESCAPE_TAIL = 0x02;

void send_frame(const uint8_t * data, uint16_t data_len) {
  put_byte(HEAD);
  for (uint32_t i = 0; i < data_len; i++)
  {
    switch(data[i]) {
      case HEAD:
        put_byte(ESCAPE);
        put_byte(ESCAPE_HEAD);
        break;
      case ESCAPE:
        put_byte(ESCAPE);
        put_byte(ESCAPE_ESCAPE);
        break;
      case TAIL:
        put_byte(ESCAPE);
        put_byte(ESCAPE_TAIL);
        break;
      default:
        put_byte(data[i]);
    }
  }
  put_byte(TAIL);
}

/**@brief   Function for handling app_uart events.
 *
 * @details This function receives a single character from the app_uart module and appends it to
 *          a string. The string is sent over BLE when the last character received is a
 *          'new line' '\n' (hex 0x0A) or if the string reaches the maximum data length.
 */
char string[170] = "Presenab99";
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint16_t index = 0;
    static bool begin = false;
    static uint8_t frame[BLE_NUS_MAX_DATA_LEN];
    static uint16_t len = 0;
    static bool escape = false;
    uint32_t ret_val;

    switch (p_event->evt_type)
    {
        /**@snippet [Handling data from UART] */
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

