atomiechen/PressureSense/nRF5_SDK_15.2.0_9412b96/examples/ble_central/serial_uart/main.c
            // parse frame
            bool finish = false;
            if (begin) {
              if (escape) {
                switch (data_array[index-1]) {
                  case ESCAPE_ESCAPE:
                    frame[len++] = ESCAPE;
                    break;
                  case ESCAPE_HEAD:
                    frame[len++] = HEAD;
                    break;
                  case ESCAPE_TAIL:
                    frame[len++] = TAIL;
                    break;
                }
                escape = false;
              } else {
                switch (data_array[index-1]) {
                  case ESCAPE:
                    escape = true;
                    break;
                  case TAIL:
                    begin = false;
                    finish = true;
                    index = 0;
                    break;
                  default:
                    frame[len++] = data_array[index-1];
                }
              }
            } else if (data_array[index-1] == HEAD) {
              begin = true;
            }

            if (!finish)
              break;

            // dispatch command
            switch (frame[0]) {
              case 0:
                // reconnect
                disconnect();
                break;
              case 1:
                // get name
                send_frame(m_target_periph_name, strlen(m_target_periph_name));
                break;
              case 2:
                // connect to specified name
                frame[len++] = '\0';
                for (int i = 1; i < len; i++)
                  string[i-1] = frame[i];
                m_target_periph_name = string;
                name_filter = true;
                scan_init();
                disconnect();
                break;
              case 3:
                // enable/disable name filter
                switch (frame[1]) {
                  case 0:
                    // disable
                    if (name_filter) {
                      name_filter = false;
                      scan_init();
                      disconnect();
                    }
                    break;
                  case 1:
                    // enable
                    if (!name_filter) {
                      name_filter = true;
                      scan_init();
                      disconnect();
                    }
                    break;
                }
                break;
              case 4:
                // switch protocol
                protocol = frame[1];
                break;
            }
            
            len = 0;
            break;
        
        
        
        
        
            //接收到上位机的“Refresh”指令
            if (data_array[index - 1] == 'R' && (index > 1) && data_array[index - 2] == 'R')
            {
              //传给上位机共14个字节
              // 头2个字节
              app_uart_put(0xEE);
              app_uart_put(0x88);
              // 中间10个字节
              if (name_filter) {
                //一般为9个字节
                for (int i=0;i<strlen(m_target_periph_name);i++)
                    app_uart_put(m_target_periph_name[i]);
                //不足的用EE补齐
                for(int i = strlen(m_target_periph_name); i < 10; i++)
                    app_uart_put(0xEE);
              } else {
                for (int i = 0; i < 10; i++) {
                  app_uart_put('\0');
                }
              }
              // 尾2个字节
              app_uart_put(0xEE);
              app_uart_put(0x77);

              // 将数组长度index重置为0
              index = 0;
            }
            
            //接收到上位机的“Update”指令
            if (data_array[index - 1] == 'U' && (index > 10) && data_array[index - 2] == 'U')
            {
                int new_name = 0;
                if(data_array[0] == 'P' && data_array[6] == 'a' && data_array[7] == 'b'){
                    new_name = data_array[8] - 0x30;
                }
                if(data_array[9] <= '9' && data_array[9] >= '0'){
                    new_name = new_name*10+(data_array[9]-0x30);
                    char a = (int)(new_name / 10) + 0x30;
                    char bb = new_name % 10 + 0x30;
                    string[8] = a;
                    string[9] = bb;
                }else{
                   char a = new_name + 0x30;
                    string[8] = a;
                    string[9] = 0;
                }
                m_target_periph_name = string;
                
                // 重新设置扫描筛选条件
                scan_init();

                // 断开连接重新扫描
                ret_code_t err_code;
                if(m_ble_nus_c.conn_handle!=BLE_CONN_HANDLE_INVALID)
                {
                    err_code = sd_ble_gap_disconnect(m_ble_nus_c.conn_handle,BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                    APP_ERROR_CHECK(err_code);
                }

                // 将数组长度index重置为0
                index = 0;
            }
            
            // 接收到上位机开启名称筛选的命令EE
            if (data_array[index - 1] == 'E' && (index > 1) && data_array[index - 2] == 'E') {
              if (!name_filter) {
                name_filter = true;
                // 重新设置扫描筛选条件
                scan_init();
                // 断开连接重新扫描
                disconnect();
              }
              // 将数组长度index重置为0
              index = 0;
            }
            
            // 接收到上位机关闭名称筛选的命令DD
            if (data_array[index - 1] == 'D' && (index > 1) && data_array[index - 2] == 'D') {
              if (name_filter) {
                name_filter = false;
                // 重新设置扫描筛选条件
                scan_init();
                // 断开连接重新扫描
                disconnect();
              }
              // 将数组长度index重置为0
              index = 0;
            }
            
            // 接收到上位机断开连接重新扫描的命令XX
            if (data_array[index - 1] == 'X' && (index > 1) && data_array[index - 2] == 'X') {
              disconnect();
              
              // 将数组长度index重置为0
              index = 0;
            }

